Tekla Open API Reference for Tekla Structures 2025
Distance.Value Property
 Gets or sets the distance value in current units.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Value { get; set; }
Public Property Value As Double
	Get
	Set
Property Value
Type: Double
 The distance value in current units.
Implements
IDoubleDataType.Value
Examples
 This example shows how to perform calculations with distances in different units.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // The default unit type is millimeter.
           Distance value1 = new Distance(30);
           // Other unit types must be specified explicitly.
           Distance value2 = new Distance(2, Distance.UnitType.Inch);
           // Perform sum calculation using the same units for both distances.
           Distance sumOfDistances = new Distance(value1.Value + value2.Value, Distance.CurrentUnitType);
       }
}
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace